IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_conf_regs.xml
<module id="CM_CONF_REGS" HW_revision="" description="CM CONF Registers">
	<register id="CMRESCTL" width="32" page="1" offset="0x0" internal="0" description="CM Reset Control Register">
		<bitfield id="RESET" description="Software reset to CM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RESETSTS" description="CM Reset status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="KEY" description="Key value" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1NMICTL" width="32" page="1" offset="0x2" internal="0" description="CM To CPU1 NMI Control register">
		<bitfield id="CMNMIWDRST" description="CMNMIWDRST NMI enable bit, enables nmi generation to C28x" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1INTCTL" width="32" page="1" offset="0x4" internal="0" description="CM To CPU1 interrupt Control register">
		<bitfield id="VECTRESET" description="VECTRESET Interrupt enable bit, enables interrupt to C28x" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SYSRESETREQ" description="SYSRESETREQ Interrupt enable bit, enables interrupt to C28x" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMNMIWDRST" description="CMNMIWDRST Interrupt enable bit, enables interrupt to C28x" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PALLOCATE0" width="32" page="1" offset="0x20" internal="0" description="CM Peripheral Allocation Register.">
		<bitfield id="USB_A" description="Allocate USB_A to CM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ETHERCAT" description="Allocate ETHERCAT to CM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAN_A" description="Allocate CANA to CM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAN_B" description="Allocate CANB to CM" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CM_CONF_REGS_LOCK" width="32" page="1" offset="0x3fe" internal="0" description="CM Configuration Registers Lock">
		<bitfield id="LOCK" description="Lock one time CM configuration registers." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
